DimaFantasy/LPP/LPP_STM32F411CEUx/Core/Src/main.c
        TIM2->CR1 &= ~TIM_CR1_OPM; // Непрерывный режим

        // Канал 1 как Timing — только для генерации прерывания CC1
        TIM_OC_InitTypeDef sConfigOC = {0};
        sConfigOC.OCMode = TIM_OCMODE_TIMING;
        sConfigOC.Pulse  = 2500; // 50% для старта
        HAL_TIM_OC_ConfigChannel(&htim2, &sConfigOC, TIM_CHANNEL_1);

        // Буферизация для синхронного изменения скважности
        TIM2->CR1   |= TIM_CR1_ARPE;
        TIM2->CCMR1 |= TIM_CCMR1_OC1PE;

        // Порядок важен: сначала EGR сброс, потом прерывания
        TIM2->DIER = 0;
        TIM2->EGR |= TIM_EGR_UG;
        TIM2->SR   = 0;
        TIM2->DIER |= TIM_DIER_UIE | TIM_DIER_CC1IE;

        HAL_NVIC_SetPriority(TIM2_IRQn, 5, 0);
        HAL_NVIC_EnableIRQ(TIM2_IRQn);

        TIM2->CR1 |= TIM_CR1_CEN;
    }

    X_MOTOR_MODE = mode;
}

/**
 * @brief Программная задержка dead-time между переключением ключей моста
 * ~1 мкс при 100МГц. Подобрать осциллографом!
 */
__STATIC_INLINE void XMotorDeadTime(void) {
    for (volatile int i = 0; i < 60; i++) { __NOP(); }
}

//// Надёжный вариант через DWT (если включен)
///**
// * @brief Универсальный DeadTime на базе тактов ядра (DWT)
// * Работает на F103 (72MHz), F411 (100MHz), G431 (170MHz)
// */
//__STATIC_INLINE void XMotorDeadTime(void) {
//    uint32_t ticks = (SystemCoreClock / 1000000) * 1; // 1 мкс
//    uint32_t start = DWT->CYCCNT;
//    while ((DWT->CYCCNT - start) < ticks);
//}

/**
 * @brief Единый обработчик прерываний TIM2
 */

// Желаемое направление
static volatile uint8_t X_DIR_NEXT = 0; // 0 = вперёд, 1 = назад

void TIM2_IRQHandler(void) {
    uint32_t sr = TIM2->SR;

    if (sr & TIM_SR_UIF) {
        TIM2->SR = ~TIM_SR_UIF;

        XTimerCallback();

        if (X_MOTOR_MODE != X_MOTOR_MODE_STEP) {

            // ✅ Сброс пинов с учётом режима
            F_RESET_PIN(&g_pins[PIN_X_MO_L]);
            F_RESET_PIN(&g_pins[PIN_X_MO_L_H]);
            F_RESET_PIN(&g_pins[PIN_X_MO_R_H]);
            // PIN_X_MO_R — DIR в ONE_PWM, сбрасываем только в TWO_PWM
            if (X_MOTOR_MODE == X_MOTOR_MODE_TWO_PWM) {
                F_RESET_PIN(&g_pins[PIN_X_MO_R]);
            }

            if (X_PWM_CURRENT != 0) {
                XMotorDeadTime();

                if (X_MOTOR_MODE == X_MOTOR_MODE_TWO_PWM) {
                    uint32_t abs_pwr = (uint32_t)abs(X_PWM_CURRENT);
                    if (abs_pwr > 5000) abs_pwr = 5000;
                    TIM2->CCR1 = abs_pwr;

                    uint8_t fwd = (X_PWM_CURRENT > 0) ? 1 : 0;
                    if (W_X_POL_PWM) fwd = !fwd;

                    if (fwd) {
                        F_SET_PIN(&g_pins[PIN_X_MO_L]);
                        F_SET_PIN(&g_pins[PIN_X_MO_R_H]);
                    } else {
                        F_SET_PIN(&g_pins[PIN_X_MO_R]);
                        F_SET_PIN(&g_pins[PIN_X_MO_L_H]);
                    }
                }
                else if (X_MOTOR_MODE == X_MOTOR_MODE_ONE_PWM) {
                    uint32_t abs_pwr = (uint32_t)abs(X_PWM_CURRENT);
                    if (abs_pwr > 5000) abs_pwr = 5000;
                    TIM2->CCR1 = abs_pwr;

                    // DIR уже выставлен в CC1IF — не трогаем
                    X_PWM_SET();
                }
            }
        }
    }

    if (sr & TIM_SR_CC1IF) {
        TIM2->SR = ~TIM_SR_CC1IF;

        if (X_MOTOR_MODE == X_MOTOR_MODE_TWO_PWM) {
            // ✅ Гасим все ключи — в TWO_PWM PIN_X_MO_R это ключ моста
            F_RESET_PIN(&g_pins[PIN_X_MO_L]);
            F_RESET_PIN(&g_pins[PIN_X_MO_R]);
            F_RESET_PIN(&g_pins[PIN_X_MO_L_H]);
            F_RESET_PIN(&g_pins[PIN_X_MO_R_H]);
        }
        else if (X_MOTOR_MODE == X_MOTOR_MODE_ONE_PWM) {
            // Гасим только ШИМ, DIR (PIN_X_MO_R) не трогаем
            X_PWM_CLR();

            // Обновляем DIR в паузе между импульсами
            X_DIR_NEXT = (X_PWM_CURRENT >= 0) ? 0 : 1;
            if (X_DIR_NEXT) X_DIR_SET();
            else            X_DIR_CLR();
        }
    }
}

/**
 * @brief Установка длительности шага (только для STEP режима)
 * @param period: длительность в мкс (при PSC=83, 1 тик = 1 мкс)
 */
void XTimerSet(uint16_t period) {
    if (X_MOTOR_MODE == X_MOTOR_MODE_STEP) {
        TIM2->ARR  = period;
        TIM2->CNT  = 0;
        TIM2->SR   = 0;             // сброс UIF перед стартом
        TIM2->CR1 |= TIM_CR1_CEN;  // старт одного импульса (OPM)
    }
}

/**
 * @brief Установка мощности мотора X
 * @param power: -5000..+5000 (0 = стоп)
 */
void XMotorSet(int power) {
    if (X_MOTOR_MODE == X_MOTOR_MODE_STEP) return;

    if (abs(power) < 10) power = 0;

    X_PWM_CURRENT = power;

    if (power == 0) {
        TIM2->CCR1 = 0;
        F_RESET_PIN(&g_pins[PIN_X_MO_L_H]);
        F_RESET_PIN(&g_pins[PIN_X_MO_R_H]);
        X_DIR_CLR();
        X_PWM_CLR();
        X_DIR_NEXT = 0; // ✅ сброс желаемого направления
    } else {
        if (power >  5000) power =  5000;
        if (power < -5000) power = -5000;
        TIM2->CCR1 = (uint32_t)abs(power);
    }
}

// ============================================================================
// ПОДСИСТЕМА PWM LASER & LIGHT (DMA-BASED)
// ============================================================================
// Глобальные переменные
volatile uint32_t dma_pwm_masks[3][2] = {0}; // [Laser, LED1, LED2][SET, RESET]
uint32_t raw_pin_masks[3] = {0};             // Маски пинов (1 << N)
uint32_t LAST_LASER_FREQ = 0;                // Защита от повторной инициализации
static const uint32_t GPIO_NULL_REG = 0;

/**
 * @brief Привязка потоков DMA к портам и маскам
 */
void PWM_LaserLight_LinkHardware(void) {
    uint8_t target_ids[3] = { PIN_PWM_LASER, PIN_PWM_LED1, PIN_PWM_LED2 };

    // МАППИНГ ДЛЯ F411 (DMA2):
    // Laser: ON = TIM1_UP  (Str 5), OFF = TIM1_CH1 (Str 1)
    // LED1:  ON = TIM1_CH4 (Str 4), OFF = TIM1_CH2 (Str 2)
    // LED2:  ON = TIM1_CH4 (Str 3), OFF = TIM1_CH3 (Str 6)
    // РЕЗУЛЬТАТ: Stream 0, Stream 7 — ПОЛНОСТЬЮ СВОБОДНЫ.
    
    DMA_Stream_TypeDef* streams_on[3]  = { DMA2_Stream5, DMA2_Stream4, DMA2_Stream3 };
    DMA_Stream_TypeDef* streams_off[3] = { DMA2_Stream1, DMA2_Stream2, DMA2_Stream6 };
    
    uint32_t ch_idx = 6; 

    for (int i = 0; i < 3; i++) {
        PIN_CFG_T *cfg = &g_pins[target_ids[i]];
        DMA_Stream_TypeDef* s_on  = streams_on[i];
        DMA_Stream_TypeDef* s_off = streams_off[i];

