DimaFantasy/LPP/LPP_STM32F411CEUx/Core/Src/main.c
        if (!cfg->used || cfg->bsrr == (uint32_t*)&GPIO_NULL_REG) {
            s_on->CR &= ~DMA_SxCR_EN;
            s_off->CR &= ~DMA_SxCR_EN;
            continue;
        }

        raw_pin_masks[i] = cfg->pin;

        // Настройка ON
        s_on->CR &= ~DMA_SxCR_EN;
        while(s_on->CR & DMA_SxCR_EN);
        s_on->PAR = (uint32_t)cfg->bsrr;
        s_on->M0AR = (uint32_t)&dma_pwm_masks[i][0];
        s_on->NDTR = 1;
        s_on->CR = (ch_idx << DMA_SxCR_CHSEL_Pos) | DMA_SxCR_DIR_0 | DMA_SxCR_CIRC | 
                   (0x02 << DMA_SxCR_PSIZE_Pos) | (0x02 << DMA_SxCR_MSIZE_Pos) | (0x03 << DMA_SxCR_PL_Pos);
        s_on->CR |= DMA_SxCR_EN;

        // Настройка OFF
        s_off->CR &= ~DMA_SxCR_EN;
        while(s_off->CR & DMA_SxCR_EN);
        s_off->PAR = (uint32_t)cfg->bsrr;
        s_off->M0AR = (uint32_t)&dma_pwm_masks[i][1];
        s_off->NDTR = 1;
        s_off->CR = (ch_idx << DMA_SxCR_CHSEL_Pos) | DMA_SxCR_DIR_0 | DMA_SxCR_CIRC | 
                    (0x02 << DMA_SxCR_PSIZE_Pos) | (0x02 << DMA_SxCR_MSIZE_Pos) | (0x03 << DMA_SxCR_PL_Pos);
        s_off->CR |= DMA_SxCR_EN;
    }
}


void SetLaserLightPWMFrequency(uint32_t freq_hz) {
    if (freq_hz == LAST_LASER_FREQ && freq_hz != 0) return;
    
    if (freq_hz == 0) { 
        TIM1->CR1 &= ~TIM_CR1_CEN; 
        LAST_LASER_FREQ = 0; 
        return; 
    }

    __HAL_RCC_TIM1_CLK_ENABLE();
    __HAL_RCC_DMA2_CLK_ENABLE();

    uint32_t pclk2 = HAL_RCC_GetPCLK2Freq();
    uint32_t tim_clk = ((RCC->CFGR & RCC_CFGR_PPRE2) != RCC_CFGR_PPRE2_DIV1) ? pclk2 * 2 : pclk2;

    uint32_t arr = 100;
    uint32_t psc_val = tim_clk / (freq_hz * (arr + 1));
    
    TIM1->PSC = (psc_val > 0) ? psc_val - 1 : 0;
    TIM1->ARR = arr;
    TIM1->CCR4 = 0; // Триггер для одновременного включения светодиодов

    // Включаем 5 запросов DMA на TIM1
    TIM1->DIER = TIM_DIER_UDE | TIM_DIER_CC1DE | TIM_DIER_CC2DE | 
                 TIM_DIER_CC3DE | TIM_DIER_CC4DE;

		// Сброс флагов DMA
		DMA2->LIFCR = (0x3F << 6) | (0x3F << 16) | (0x3F << 22);
		DMA2->HIFCR = (0x3F << 0) | (0x3F << 6)  | (0x3F << 16);

    PWM_LaserLight_LinkHardware();

    TIM1->BDTR |= TIM_BDTR_MOE;
    TIM1->EGR |= TIM_EGR_UG; // Прогружаем настройки
    TIM1->SR = 0; 
    TIM1->CR1 |= TIM_CR1_CEN; 
    
    LAST_LASER_FREQ = freq_hz;
}

/**
 * @brief Отключение лазера с блокировкой
 */
void Laser_Off(void) {
    LASER_SAFETY_LOCK = 1;
    HAL_TIM_Base_Stop_IT(&htim3); 
    SetLaserPWM(0);
    TIM1->EGR |= TIM_EGR_UG;
    F_RESET_PIN(&g_pins[PIN_PWM_LASER]);
}

/**
 * @brief Подготовка лазера к работе
 */
void Laser_Ready(void) {
    TIM3->CNT = 0;
    interp_counter = 0; 
    TIM1->CNT = 0;
    TIM1->EGR |= TIM_EGR_UG;
    LASER_SAFETY_LOCK = 0;
}

/**
 * @brief Сверхбыстрое управление мощностью лазера (Branchless)
 */
inline void SetLaserPWM(uint16_t val) {
    if (LASER_SAFETY_LOCK) val = 0;
    if (val > 100) val = 100;

    dma_pwm_masks[0][0] = (val > 0) ? raw_pin_masks[0] : 0;
    dma_pwm_masks[0][1] = (val < 100) ? (raw_pin_masks[0] << 16) : 0;
    TIM1->CCR1 = val;

    if (val == 0) F_RESET_PIN(&g_pins[PIN_PWM_LASER]);
}

inline void SetLight1PWM(uint16_t val) {  
    if (val > 100) val = 100;
    dma_pwm_masks[1][0] = (val > 0) ? raw_pin_masks[1] : 0;
    dma_pwm_masks[1][1] = (val < 100) ? (raw_pin_masks[1] << 16) : 0;
    TIM1->CCR2 = val;
    if (val == 0) F_RESET_PIN(&g_pins[PIN_PWM_LED1]);
}

inline void SetLight2PWM(uint16_t val) {  
    if (val > 100) val = 100;
    dma_pwm_masks[2][0] = (val > 0) ? raw_pin_masks[2] : 0;
    dma_pwm_masks[2][1] = (val < 100) ? (raw_pin_masks[2] << 16) : 0;
    TIM1->CCR3 = val;
    if (val == 0) F_RESET_PIN(&g_pins[PIN_PWM_LED2]);
}

// ============================================================================
// DMA M2M
// ============================================================================
void DMA_M2M_Init(void) {
    __HAL_RCC_DMA2_CLK_ENABLE();

    // Полностью копируем HAL_DMA_Init:
    DMA2_Stream0->CR = 0;
    while(DMA2_Stream0->CR & DMA_SxCR_EN);

    // Сброс всех флагов Stream0
    DMA2->LIFCR = 0x3F;

    // CR: Channel0, M2M, Priority Low, 8bit->8bit, PINC+MINC, Normal
    DMA2_Stream0->CR = (0 << DMA_SxCR_CHSEL_Pos)  | // Channel 0
                       DMA_SxCR_DIR_1              | // Memory-to-Memory
                       (0 << DMA_SxCR_PL_Pos)      | // Priority Low
                       (0 << DMA_SxCR_MSIZE_Pos)   | // 8-bit Memory
                       (0 << DMA_SxCR_PSIZE_Pos)   | // 8-bit Periph
                       DMA_SxCR_MINC               | // Memory increment
                       DMA_SxCR_PINC;                // Periph increment

    // FCR: FIFO enable, Full threshold, Single burst — ОБЯЗАТЕЛЬНО для M2M
    DMA2_Stream0->FCR = DMA_SxFCR_DMDIS | (0x03 << DMA_SxFCR_FTH_Pos);

    HAL_NVIC_SetPriority(DMA2_Stream0_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(DMA2_Stream0_IRQn);
}

void FIFO_DATA_StartDma(uint32_t src, uint32_t dst, uint16_t count) {
    // Копируем HAL_DMA_Start_IT:
    
    // 1. Disable
    DMA2_Stream0->CR &= ~DMA_SxCR_EN;
    while(DMA2_Stream0->CR & DMA_SxCR_EN);

    // 2. Сброс флагов
    DMA2->LIFCR = 0x3F;

    // 3. Адреса и размер
    DMA2_Stream0->PAR  = src;
    DMA2_Stream0->M0AR = dst;
    DMA2_Stream0->NDTR = count;

    // 4. FCR заново (сбрасывается при выключении)
    DMA2_Stream0->FCR = DMA_SxFCR_DMDIS | (0x03 << DMA_SxFCR_FTH_Pos);

    // 5. Включаем прерывания и запускаем — всё в одной записи
    DMA2_Stream0->CR |= DMA_SxCR_TCIE | DMA_SxCR_TEIE | DMA_SxCR_DMEIE;
    DMA2_Stream0->CR |= DMA_SxCR_EN;
}

void DMA2_Stream0_IRQHandler(void) {
    uint32_t isr = DMA2->LISR;

    if (isr & DMA_LISR_TCIF0) {
        DMA2->LIFCR = DMA_LIFCR_CTCIF0;
        FIFO_DATA_EndDma();
    }
    if (isr & DMA_LISR_TEIF0) {
        DMA2->LIFCR = DMA_LIFCR_CTEIF0;
        // обработка ошибки
    }
    if (isr & DMA_LISR_DMEIF0) {
        DMA2->LIFCR = DMA_LIFCR_CDMEIF0;
        // direct mode error — не должно быть при FIFO
    }
}

// ============================================================================
// HAL CALLBACKS
// ============================================================================

/**
 * @brief HAL callback для периодических событий таймера
 * @note F411: TIM3 и TIM4 на APB1 (42MHz), с делителем тактируются 84MHz
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef* htim)
{
    // TIM3 - Интерполяция печати
    if (htim->Instance == TIM3) {
        if (XInterpTimerCallback() == 0) {
            HAL_TIM_Base_Stop_IT(&htim3);
            TIM3->CNT = 0;
        }
    }
    // TIM4 - Управление осью Y
    if (htim->Instance == TIM4) {
        YTimerCallback();
    }
}

/**
 * @brief Установка периода и запуск таймера YTimer
 */
void YTimerSet(uint16_t period)
{
    __HAL_TIM_SET_AUTORELOAD(&htim4, period);
    __HAL_TIM_ENABLE(&htim4);
}

/**
 * @brief Запуск интерполяционного таймера
 */
void XInterpTimerStart(uint32_t period) {
    TIM3->ARR = period;
    TIM3->SR &= ~TIM_SR_UIF;
    TIM3->DIER |= TIM_DIER_UIE;
    TIM3->CR1 |= TIM_CR1_CEN;
}

// ============================================================================
// EXTI HANDLERS
// ============================================================================

/**
 * @brief Наш собственный быстрый обработчик прерываний
 * @param pin_mask Битовая маска сработавших пинов
 */
void LPP_GPIO_EXTI_Handler(uint16_t pin_mask) {
    XEncoderCallback(pin_mask); 
}

// F411: EXTI handlers идентичны G431
void EXTI0_IRQHandler(void) { EXTI->PR = (1U << 0); LPP_GPIO_EXTI_Handler(1U << 0); }
void EXTI1_IRQHandler(void) { EXTI->PR = (1U << 1); LPP_GPIO_EXTI_Handler(1U << 1); }
void EXTI2_IRQHandler(void) { EXTI->PR = (1U << 2); LPP_GPIO_EXTI_Handler(1U << 2); }
void EXTI3_IRQHandler(void) { EXTI->PR = (1U << 3); LPP_GPIO_EXTI_Handler(1U << 3); }
void EXTI4_IRQHandler(void) { EXTI->PR = (1U << 4); LPP_GPIO_EXTI_Handler(1U << 4); }

void EXTI9_5_IRQHandler(void) {
    uint32_t pr = EXTI->PR & 0x03E0; 
    if (pr) {
        EXTI->PR = pr;
        LPP_GPIO_EXTI_Handler(pr); 
    }
}

void EXTI15_10_IRQHandler(void) {
    uint32_t pr = EXTI->PR & 0xFC00; 
    if (pr) {
        EXTI->PR = pr; 
        LPP_GPIO_EXTI_Handler(pr);
    }
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
